Autodesk.Revit.DB.MathComparisonUtils.IsAlmostZero(System.Double)
Checks if value is almost zero, using the internal tolerance.
value:
The value to check.
Returns:
True if value is almost zero, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not finite
Since:
2021

Autodesk.Revit.DB.MathComparisonUtils.IsLessThan(System.Double,System.Double)
Checks if value1 is strictly less than value2, using the internal tolerance.
value1:
The first value.
value2:
The second value.
Returns:
True if value1 is strictly less than value2, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value1 is not finite
-or-
The given value for value2 is not finite
Since:
2021

Autodesk.Revit.DB.MathComparisonUtils.IsLessThanOrAlmostEqual(System.Double,System.Double)
Checks if value1 is less than or almost equal to value2, using the internal tolerance.
value1:
The first value.
value2:
The second value.
Returns:
True if value1 is less than or almost equal to value2, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value1 is not finite
-or-
The given value for value2 is not finite
Since:
2021

Autodesk.Revit.DB.MathComparisonUtils.IsGreaterThan(System.Double,System.Double)
Checks if value1 is strictly greater than value2, using the internal tolerance.
value1:
The first value.
value2:
The second value.
Returns:
True if value1 is strictly greater than value2, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value1 is not finite
-or-
The given value for value2 is not finite
Since:
2021

Autodesk.Revit.DB.MathComparisonUtils.IsGreaterThanOrAlmostEqual(System.Double,System.Double)
Checks if value1 is greater than or almost equal to value2, using the internal tolerance.
value1:
The first value.
value2:
The second value.
Returns:
True if value1 is greater than or almost equal to value2, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value1 is not finite
-or-
The given value for value2 is not finite
Since:
2021

Autodesk.Revit.DB.MathComparisonUtils.IsAlmostEqual(System.Double,System.Double)
Checks if two doubles are almost equal, using the internal tolerance.
value1:
The first value.
value2:
The second value.
Returns:
True if two doubles are almost equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value1 is not finite
-or-
The given value for value2 is not finite
Since:
2021

Autodesk.Revit.DB.MathComparisonUtils
This class contains a set of mathematical utilities to compare doubles, using the internal tolerance.
Since:
2021